# Brewfile - macOS package dependencies
# Install with: brew bundle

# Essential tools
brew "git-delta"      # Syntax-highlighting pager for git
brew "diffnav"        # GitHub-style file-tree diff pager (used by lazygit PR-diff commands)
brew "git-town"       # Git workflow automation
brew "neovim"         # Text editor
brew "lazygit"        # Git TUI

# Shell enhancements
brew "starship"             # Cross-shell prompt
brew "zoxide"               # Smarter cd command
brew "mise"                 # Development tool version manager
brew "mcfly"                # Command line fuzzy history search
brew "antidote"  # Fish-like autosuggestions for zsh

# Optional but recommended
brew "fzf"          # Fuzzy finder
brew "bat"          # Better cat with syntax highlighting
brew "glow"         # Markdown renderer for the terminal (PR bodies, etc.)
brew "eza"          # Modern ls replacement
brew "ripgrep"      # Better grep
brew "fd"           # Better find
